src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникКонтрагента</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Пользователи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)      
	ПользовательИБ =ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	Если ПользовательИБ= Неопределено тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.ПолноеИмя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.Пароль = ТекущийОбъект.Пароль;      
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(Роль));
		ПользовательИБ.Записать();
		ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	Иначе	
		
		ПользовательИБ.Имя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.ПолноеИмя = ТекущийОбъект.ПользовательИБ;
		ПользовательИБ.Пароль = ТекущийОбъект.Пароль;       
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(Роль));
		ПользовательИБ.Записать();
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПользовательИБ =ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	Элементы.Роль.СписокВыбора.Очистить();
	Для каждого стр из Метаданные.Роли цикл
		Элементы.Роль.СписокВыбора.Добавить(стр.Имя);
		Если ПользовательИБ<>Неопределено и ПользовательИБ.Роли.Содержит(стр) тогда 
			Роль = стр.имя;
		КонецЕсли;	
	КонецЦикла;	  
		
КонецПроцедуры
